Revit 2024 API
WireMaterialTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual WireMaterialTypeSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As WireMaterialTypeSetIterator
Visual C++
public:
virtual WireMaterialTypeSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
WireMaterialTypeSet Class
Autodesk.Revit.DB.Electrical Namespace